# UnloadServices Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..UnloadServices Method
FabricationConfiguration Class See Also
---
Unload the specified fabrication services from the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void UnloadServices(
	IList<int> serviceIds
)
```

Visual Basic
---
```text
Public Sub UnloadServices ( _
	serviceIds As IList(Of Integer) _
)
```

Visual C++
---
```text
public:
void UnloadServices(
	IList<int>^ serviceIds
)
```

# ### Parameters
serviceIds
    Type: System.Collections.Generic..::..IList<(Of <(<'Int32>)>)> The identifiers of the fabrication services to unload.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Fabrication services can not be unloaded if they are in use currently. -or- Some services are not loaded yet. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The current fabrication configuration is not connected and updated to source configuration. Reload and try again. |

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace